rails-todo/app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("item_text", "created_at", "updated_at") VALUES (?, ?, ?)  [["item_text", "Take the trash out"], ["created_at", "2016-02-22 23:41:44.607282"], ["updated_at", "2016-02-22 23:41:44.607282"]]